DragonScript.org
#+TITLE:  Dragon Script
#+AUTHOR: Comcx
#+DATE:   <2019-04-09 二>

:IDEA:

 Well I suddenly contrived the idea that I should find some basic(atom)
 problems which can be used or composed in various kinds of problems,
 which can save some time.
 
 Therefore, I'm planning to reconstruct the structure of this script.
 not only just records of my solutions of katas, but all simple ideas
 novelty :)

:END:


* Weapons

** Books
*** Concrete Mathematics
*** CLRS

* Dragons [11/13]

** DONE Longest Substring Without Repeating Characters                 :EASY:

*** Description

Given a string, find the length of the longest substring without repeating characters.
#+BEGIN_SRC
Example 1:
Input: "abcabcbb"
Output: 3 
Explanation: The answer is "abc", with the length of 3. 

Example 2:
Input: "bbbbb"
Output: 1
Explanation: The answer is "b", with the length of 1.

Example 3:
Input: "pwwkew"
Output: 3
Explanation: The answer is "wke", with the length of 3. 
Note that the answer must be a substring, "pwke" is a subsequence and not a substring.
#+END_SRC

*** Analysis
  Let's generalize this problem a little bit:

**** Settings
   - Say our indices in the array comes from 0.
   - Our solver 
       =f : Seq a ==> Index -> (List a -> a -> Bool) -> (List a, Length)=
       which gives the answer on the range index of [0, n]
**** Environment
   s : List a
**** Pseudocode
#+BEGIN_SRC haskell
f 0 p = if p [] (s 0) then ([s 0], 1) else ([], 0)
f n p = if p a (s n) then (a ++ [s n], len + 1) else ([s n], 0)
where
  (a, len) = f (n - 1) p

-- Here we can make
p a x = not $ elem a x

main = f (length s - 1) p
#+END_SRC

Ok, we can see now we must tranverse the entire array, which is O(n),
therefore, the complexity is depend on the complexity of function *p*.

I we use hash, we can have function p with time complexity O(1)
and finally we have O(n) algorithm.

If we do not use hash, any better way?

