DragonScript.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-06 日 21:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dragon Script</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
</head>
<body>
<div id="content">
<h1 class="title">Dragon Script</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd247c66">1. Weapons</a></li>
<li><a href="#org0ef8dec">2. Dragons <code>[11/13]</code></a>
<ul>
<li><a href="#orgcf49bc7">2.1. <span class="done DONE">DONE</span> Longest Substring Without Repeating Characters&#xa0;&#xa0;&#xa0;<span class="tag"><span class="EASY">EASY</span></span></a>
<ul>
<li><a href="#org017602c">2.1.1. Description</a></li>
<li><a href="#org7efcbeb">2.1.2. Analysis</a></li>
<li><a href="#org7f35146">2.1.3. Solution</a></li>
</ul>
</li>
<li><a href="#org298a7eb">2.2. <span class="done DONE">DONE</span> Find The Parity Outlier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="EASY">EASY</span></span></a>
<ul>
<li><a href="#org59116bc">2.2.1. Description</a></li>
<li><a href="#org0b027c4">2.2.2. Solution</a></li>
</ul>
</li>
<li><a href="#org62ea87c">2.3. <span class="todo NEXT">NEXT</span> Cycle detection&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MEDI">MEDI</span></span></a>
<ul>
<li><a href="#orge88e12c">2.3.1. Extant</a></li>
<li><a href="#orgf03f820">2.3.2. Floyd algorithm</a></li>
<li><a href="#org865a7ab">2.3.3. Bernt's algorithm(The Teleporting Turtle)</a></li>
<li><a href="#org21c9c0d">2.3.4. Experiment</a></li>
</ul>
</li>
<li><a href="#org5178d5c">2.4. <span class="done DONE">DONE</span> Factorial decomposition&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MEDI">MEDI</span></span></a>
<ul>
<li><a href="#orgf15e5b3">2.4.1. Description</a></li>
<li><a href="#orgf900f62">2.4.2. Solution</a></li>
</ul>
</li>
<li><a href="#org8fd2a0a">2.5. <span class="done DONE">DONE</span> Counting Change Combinations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MEDI">MEDI</span></span></a>
<ul>
<li><a href="#org00ff4ad">2.5.1. Description</a></li>
<li><a href="#org0bf56a0">2.5.2. Analysis</a></li>
<li><a href="#org48ca3fe">2.5.3. Solution</a></li>
</ul>
</li>
<li><a href="#org5113345">2.6. <span class="done DONE">DONE</span> Longest Palindromic Substring</a>
<ul>
<li><a href="#org43b6b52">2.6.1. Description</a></li>
<li><a href="#org81c1f4f">2.6.2. Solution</a></li>
</ul>
</li>
<li><a href="#orgd68245a">2.7. <span class="done DONE">DONE</span> ZigZag Conversion</a>
<ul>
<li><a href="#orgf911421">2.7.1. Description</a></li>
<li><a href="#org7d31aa3">2.7.2. Solution</a></li>
</ul>
</li>
<li><a href="#org089f41f">2.8. <span class="done DONE">DONE</span> Maximum Subarray</a>
<ul>
<li><a href="#orgfef68f0">2.8.1. Description</a></li>
<li><a href="#orgd9dcebf">2.8.2. Solution</a></li>
</ul>
</li>
<li><a href="#org05f05dd">2.9. <span class="done DONE">DONE</span> Climbing Stairs</a>
<ul>
<li><a href="#orgf1f45c5">2.9.1. Description</a></li>
<li><a href="#org388e0fa">2.9.2. Solution</a></li>
</ul>
</li>
<li><a href="#orgd80335d">2.10. <span class="done DONE">DONE</span> Regular Expression Matching</a>
<ul>
<li><a href="#org2ef7313">2.10.1. Description</a></li>
<li><a href="#org31118c0">2.10.2. Solution</a></li>
</ul>
</li>
<li><a href="#org29a3de3">2.11. <span class="done DONE">DONE</span> Wildcard Matching</a>
<ul>
<li><a href="#orgbf09da7">2.11.1. Description</a></li>
<li><a href="#org138cb1b">2.11.2. Solution</a></li>
</ul>
</li>
<li><a href="#org5b0453a">2.12. <span class="todo TODO">TODO</span> The Josephus Problem</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>

</p>

<p>
Well I suddenly contrived the idea that I should find some basic(atom)
problems which can be used or composed in various kinds of problems,
which can save some time.
</p>

<p>
Therefore, I'm planning to reconstruct the structure of this script.
not only just records of my solutions of katas, but all simple ideas
novelty :)
</p>


<div id="outline-container-orgd247c66" class="outline-2">
<h2 id="orgd247c66"><span class="section-number-2">1</span> Weapons</h2>
</div>



<div id="outline-container-org0ef8dec" class="outline-2">
<h2 id="org0ef8dec"><span class="section-number-2">2</span> Dragons <code>[11/13]</code></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcf49bc7" class="outline-3">
<h3 id="orgcf49bc7"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> Longest Substring Without Repeating Characters&#xa0;&#xa0;&#xa0;<span class="tag"><span class="EASY">EASY</span></span></h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org017602c" class="outline-4">
<h4 id="org017602c"><span class="section-number-4">2.1.1</span> Description</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Given a string, find the length of the longest substring without repeating characters.
</p>
<pre class="example">
Example 1:
Input: "abcabcbb"
Output: 3 
Explanation: The answer is "abc", with the length of 3. 

Example 2:
Input: "bbbbb"
Output: 1
Explanation: The answer is "b", with the length of 1.

Example 3:
Input: "pwwkew"
Output: 3
Explanation: The answer is "wke", with the length of 3. 
Note that the answer must be a substring, "pwke" is a subsequence and not a substring.
</pre>
</div>
</div>

<div id="outline-container-org7efcbeb" class="outline-4">
<h4 id="org7efcbeb"><span class="section-number-4">2.1.2</span> Analysis</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Let's generalize this problem a little bit:
</p>
</div>

<ol class="org-ol">
<li><a id="org845246c"></a>Settings<br />
<div class="outline-text-5" id="text-2-1-2-1">
<ul class="org-ul">
<li>Say our indices in the array comes from 0.</li>
<li>Our solver 
<code>f : Seq a ==&gt; Index -&gt; (List a -&gt; a -&gt; Bool) -&gt; (List a, Length)</code>
which gives the answer on the range index of [0, n]</li>
</ul>
</div>
</li>
<li><a id="org35f30d4"></a>Environment<br />
<div class="outline-text-5" id="text-2-1-2-2">
<p>
s : List a
</p>
</div>
</li>
<li><a id="org639e9bf"></a>Pseudocode<br />
<div class="outline-text-5" id="text-2-1-2-3">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">f</span> 0 p <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #729fcf; font-weight: bold;">if</span> p <span style="color: #ffd700; font-weight: bold;">[]</span> <span style="color: #ffd700;">(</span>s 0<span style="color: #ffd700;">)</span> <span style="color: #729fcf; font-weight: bold;">then</span> <span style="color: #ffd700;">(</span><span style="color: #00bfff;">[</span>s 0<span style="color: #00bfff;">]</span>, 1<span style="color: #ffd700;">)</span> <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #ffd700;">(</span><span style="color: #00bfff; font-weight: bold;">[]</span>, 0<span style="color: #ffd700;">)</span>
<span style="color: #edd400; font-weight: bold;">f</span> n p <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #729fcf; font-weight: bold;">if</span> p a <span style="color: #ffd700;">(</span>s n<span style="color: #ffd700;">)</span> <span style="color: #729fcf; font-weight: bold;">then</span> <span style="color: #ffd700;">(</span>a <span style="color: #ff6347; font-weight: bold;">++</span> <span style="color: #00bfff;">[</span>s n<span style="color: #00bfff;">]</span>, len <span style="color: #ff6347; font-weight: bold;">+</span> 1<span style="color: #ffd700;">)</span> <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #ffd700;">(</span><span style="color: #00bfff;">[</span>s n<span style="color: #00bfff;">]</span>, 0<span style="color: #ffd700;">)</span>
<span style="color: #729fcf; font-weight: bold;">where</span>
  <span style="color: #ffd700;">(</span>a, len<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> f <span style="color: #ffd700;">(</span>n <span style="color: #ff6347; font-weight: bold;">-</span> 1<span style="color: #ffd700;">)</span> p

<span style="color: #888a85; font-style: italic;">-- </span><span style="color: #888a85; font-style: italic;">Here we can make</span>
<span style="color: #edd400; font-weight: bold;">p</span> a x <span style="color: #ff6347; font-weight: bold;">=</span> not <span style="color: #ff6347; font-weight: bold;">$</span> elem a x

<span style="color: #edd400; font-weight: bold;">main</span> <span style="color: #ff6347; font-weight: bold;">=</span> f <span style="color: #ffd700;">(</span>length s <span style="color: #ff6347; font-weight: bold;">-</span> 1<span style="color: #ffd700;">)</span> p
</pre>
</div>

<p>
Ok, we can see now we must tranverse the entire array, which is O(n),
therefore, the complexity is depend on the complexity of function <b>p</b>.
</p>

<p>
I we use hash, we can have function p with time complexity O(1)
and finally we have O(n) algorithm.
</p>

<p>
If we do not use hash, any better way?
</p>
</div>
</li>
</ol>
</div>
