DragonScript.html

<div id="outline-container-org7f35146" class="outline-4">
<h4 id="org7f35146"><span class="section-number-4">2.1.3</span> Solution</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">O(nlgn)?? or better?</span>
<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">Failed to find a better way to check if current elem already existed</span>
<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">use array[256]:(</span>

<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">I tried several several times on Leet but failed:(! Switching back to CodeWars</span>
<span style="color: #729fcf; font-weight: bold;">class</span> <span style="color: #8ae234; font-weight: bold;">Solution</span> <span style="color: #ffd700;">{</span>
<span style="color: #729fcf; font-weight: bold;">public</span>:

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">lengthOfLongestSubstring</span><span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347; font-weight: bold;">s</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
        
  <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">ans</span> = 1;
  <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">acc</span><span style="color: #ffa500;">[</span>256<span style="color: #ffa500;">]</span>;
  <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">p</span> = 0;
  
  memset<span style="color: #ffa500;">(</span>acc, 0, 256<span style="color: #ffa500;">)</span>;
  <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">i</span> = 0; i &lt; s.size<span style="color: #ff7f50;">()</span>; ++i<span style="color: #ffa500;">)</span> <span style="color: #ffa500;">{</span>
    
    <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ff7f50;">(</span>acc<span style="color: #00ff00;">[</span>s<span style="color: #a020f0;">[</span>i<span style="color: #a020f0;">]</span><span style="color: #00ff00;">]</span> == 1<span style="color: #ff7f50;">)</span> <span style="color: #ff7f50;">{</span>

      <span style="color: #729fcf; font-weight: bold;">while</span><span style="color: #00ff00;">(</span>s<span style="color: #a020f0;">[</span>p<span style="color: #a020f0;">]</span> != s<span style="color: #a020f0;">[</span>i<span style="color: #a020f0;">]</span><span style="color: #00ff00;">)</span> <span style="color: #00ff00;">{</span>
      
        acc<span style="color: #a020f0;">[</span>s<span style="color: #ffff00;">[</span>p<span style="color: #ffff00;">]</span><span style="color: #a020f0;">]</span> = 0;
        ++p;
      <span style="color: #00ff00;">}</span>
      p += 1;
      ans = <span style="color: #00ff00;">(</span>ans &lt; i-p+1<span style="color: #00ff00;">)</span> ? i-p+1 : ans;
    <span style="color: #ff7f50;">}</span>
    <span style="color: #729fcf; font-weight: bold;">else</span> ans = <span style="color: #ff7f50;">(</span>ans &lt; i-p+1<span style="color: #ff7f50;">)</span> ? i-p+1 : ans;
    acc<span style="color: #ff7f50;">[</span>s<span style="color: #00ff00;">[</span>i<span style="color: #00ff00;">]</span><span style="color: #ff7f50;">]</span> = 1;
  <span style="color: #ffa500;">}</span>
  <span style="color: #729fcf; font-weight: bold;">return</span> ans;
<span style="color: #00bfff;">}</span>

<span style="color: #ffd700;">}</span>;



</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org298a7eb" class="outline-3">
<h3 id="org298a7eb"><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> Find The Parity Outlier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="EASY">EASY</span></span></h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org59116bc" class="outline-4">
<h4 id="org59116bc"><span class="section-number-4">2.2.1</span> Description</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
You are given an array (which will have a length of at least 3, 
but could be very large) containing integers. 
The array is either entirely comprised of odd integers or 
entirely comprised of even integers except for a single integer N. 
Write a method that takes the array as an argument and returns this "outlier" N.
</p>
<pre class="example">

Examples
[2, 4, 0, 100, 4, 11, 2602, 36]
Should return: 11 (the only odd number)

[160, 3, 1719, 19, 11, 13, -21]
Should return: 160 (the only even number)
</pre>
</div>
</div>

<div id="outline-container-org0b027c4" class="outline-4">
<h4 id="org0b027c4"><span class="section-number-4">2.2.2</span> Solution</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">FindOutlier</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">std</span>::<span style="color: #8ae234; font-weight: bold;">vector</span><span style="color: #00bfff;">&lt;</span><span style="color: #8ae234; font-weight: bold;">int</span><span style="color: #00bfff;">&gt;</span> <span style="color: #ff6347; font-weight: bold;">arr</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">even</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">odd</span>;
  
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">evenCount</span> = 0;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">oddCount</span> = 0;
  
    <span style="color: #729fcf; font-weight: bold;">for</span> <span style="color: #00bfff;">(</span><span style="color: #729fcf; font-weight: bold;">auto</span> <span style="color: #ff6347; font-weight: bold;">a</span> : arr<span style="color: #00bfff;">)</span>
        a % 2 == 0 ? <span style="color: #00bfff;">(</span>evenCount++, even = a<span style="color: #00bfff;">)</span> : <span style="color: #00bfff;">(</span>oddCount++, odd = a<span style="color: #00bfff;">)</span>;
  
    <span style="color: #729fcf; font-weight: bold;">return</span> evenCount &lt; oddCount ? even : odd;
<span style="color: #ffd700;">}</span>


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org62ea87c" class="outline-3">
<h3 id="org62ea87c"><span class="section-number-3">2.3</span> <span class="todo NEXT">NEXT</span> Cycle detection&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MEDI">MEDI</span></span></h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orge88e12c" class="outline-4">
<h4 id="orge88e12c"><span class="section-number-4">2.3.1</span> Extant</h4>
</div>
<div id="outline-container-orgf03f820" class="outline-4">
<h4 id="orgf03f820"><span class="section-number-4">2.3.2</span> Floyd algorithm</h4>
</div>


<div id="outline-container-org865a7ab" class="outline-4">
<h4 id="org865a7ab"><span class="section-number-4">2.3.3</span> Bernt's algorithm(The Teleporting Turtle)</h4>
</div>

<div id="outline-container-org21c9c0d" class="outline-4">
<h4 id="org21c9c0d"><span class="section-number-4">2.3.4</span> Experiment</h4>
</div>
</div>

<div id="outline-container-org5178d5c" class="outline-3">
<h3 id="org5178d5c"><span class="section-number-3">2.4</span> <span class="done DONE">DONE</span> Factorial decomposition&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MEDI">MEDI</span></span></h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orgf15e5b3" class="outline-4">
<h4 id="orgf15e5b3"><span class="section-number-4">2.4.1</span> Description</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
The aim of the kata is to decompose n! (factorial n) into its prime factors.
</p>
<pre class="example">
Examples:

n = 12; decomp(12) -&gt; "2^10 * 3^5 * 5^2 * 7 * 11"
since 12! is divisible by 2 ten times, by 3 five times, by 5 two times and by 7 and 11 only once.

n = 22; decomp(22) -&gt; "2^19 * 3^9 * 5^4 * 7^3 * 11^2 * 13 * 17 * 19"

n = 25; decomp(25) -&gt; 2^22 * 3^10 * 5^6 * 7^3 * 11^2 * 13 * 17 * 19 * 23
Prime numbers should be in increasing order. When the exponent of a prime is 1 don't put the exponent.

</pre>
<p>
<b>Notes</b>
</p>

<ul class="org-ul">
<li>the function is decomp(n) and should return the decomposition of n! into 
its prime factors in increasing order of the primes, as a string.</li>
<li>factorial can be a very big number (4000! has 12674 digits, n will go from 300 to 4000).</li>
</ul>
</div>
</div>
