DragonScript.org
*** Solution
#+BEGIN_SRC c++
#include <string>
#include <map>
#include <sstream>

using std::vector;
using std::string;
using std::map;
string decomp(int n) {
  
  string ans("");
  std::stringstream ss;
  map<int, int> rc {};
  for(int i(2); i <= n; ++i) {
    
    int cur(i);
    for(auto &p : rc) {
      while(cur % p.first == 0) {
        cur /= p.first;
        p.second++;
      }
    }
    if(cur > 1) rc[cur] = 1;
  }
  for(auto p : rc) {
    
    (p.second == 1) ?
      ss << p.first : 
      ss << p.first << "^" << p.second;
    ss << " * ";
  }
  ans = ss.str();
  
  return ans.substr(0, ans.length() - 3);
}
#+END_SRC

** DONE Counting Change Combinations                                   :MEDI:

*** Description
Write a function that counts how many different ways you can make change for an amount of money, 
given an array of coin denominations. 
For example, there are 3 ways to give change for 4 if you have coins with denomination 1 and 2:
=1+1+1+1, 1+1+2, 2+2.=

The order of coins does not matter:
=1+1+2 == 2+1+1=

Also, assume that you have an infinite amount of coins.

Your function should take an amount to change and an array of unique denominations for the coins:

#+BEGIN_SRC c++
count_change(4,  {1,2})   // => 3
count_change(10, {5,2,3}) // => 4
count_change(11, {5,7})   // => 0
#+END_SRC

*** Analysis

#+BEGIN_SRC haskell

-- m := money
-- i := index of coins
count m i = count (m - (coins i)) i + count m (i + 1)
count 0 _ = 1
#+END_SRC
found a bug here, you can't export to html if u have codes on the 1st line of haskell code block
**** Complexity
   underwork

