DragonScript.html

<div id="outline-container-orgf900f62" class="outline-4">
<h4 id="orgf900f62"><span class="section-number-4">2.4.2</span> Solution</h4>
<div class="outline-text-4" id="text-2-4-2">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #729fcf;">#include</span> <span style="color: #ffd700; font-style: italic;">&lt;</span><span style="color: #ad7fa8; font-style: italic;">string</span><span style="color: #ffd700; font-style: italic;">&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ffd700; font-style: italic;">&lt;</span><span style="color: #ad7fa8; font-style: italic;">map</span><span style="color: #ffd700; font-style: italic;">&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ffd700; font-style: italic;">&lt;</span><span style="color: #ad7fa8; font-style: italic;">sstream</span><span style="color: #ffd700; font-style: italic;">&gt;</span>

<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #8ae234; font-weight: bold;">std</span>::<span style="color: #8ae234; font-weight: bold;">vector</span>;
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #8ae234; font-weight: bold;">std</span>::<span style="color: #8ae234; font-weight: bold;">string</span>;
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #8ae234; font-weight: bold;">std</span>::<span style="color: #8ae234; font-weight: bold;">map</span>;
<span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #edd400; font-weight: bold;">decomp</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">n</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>
  
  <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347; font-weight: bold;">ans</span><span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">""</span><span style="color: #00bfff;">)</span>;
  <span style="color: #8ae234; font-weight: bold;">std</span>::<span style="color: #8ae234; font-weight: bold;">stringstream</span> <span style="color: #ff6347; font-weight: bold;">ss</span>;
  <span style="color: #8ae234; font-weight: bold;">map</span><span style="color: #00bfff;">&lt;</span><span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">int</span><span style="color: #00bfff;">&gt;</span> <span style="color: #ff6347; font-weight: bold;">rc</span> <span style="color: #00bfff;">{}</span>;
  <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">i</span><span style="color: #ffa500;">(</span>2<span style="color: #ffa500;">)</span>; i &lt;= n; ++i<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
    
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">cur</span><span style="color: #ffa500;">(</span>i<span style="color: #ffa500;">)</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #ffa500;">(</span><span style="color: #729fcf; font-weight: bold;">auto</span> &amp;<span style="color: #ff6347; font-weight: bold;">p</span> : rc<span style="color: #ffa500;">)</span> <span style="color: #ffa500;">{</span>
      <span style="color: #729fcf; font-weight: bold;">while</span><span style="color: #ff7f50;">(</span>cur % p.first == 0<span style="color: #ff7f50;">)</span> <span style="color: #ff7f50;">{</span>
        cur /= p.first;
        p.second++;
      <span style="color: #ff7f50;">}</span>
    <span style="color: #ffa500;">}</span>
    <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ffa500;">(</span>cur &gt; 1<span style="color: #ffa500;">)</span> rc<span style="color: #ffa500;">[</span>cur<span style="color: #ffa500;">]</span> = 1;
  <span style="color: #00bfff;">}</span>
  <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span><span style="color: #729fcf; font-weight: bold;">auto</span> <span style="color: #ff6347; font-weight: bold;">p</span> : rc<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
    
    <span style="color: #ffa500;">(</span>p.second == 1<span style="color: #ffa500;">)</span> ?
      ss &lt;&lt; p.first : 
      ss &lt;&lt; p.first &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"^"</span> &lt;&lt; p.second;
    ss &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" * "</span>;
  <span style="color: #00bfff;">}</span>
  ans = ss.str<span style="color: #00bfff;">()</span>;
  
  <span style="color: #729fcf; font-weight: bold;">return</span> ans.substr<span style="color: #00bfff;">(</span>0, ans.length<span style="color: #ffa500;">()</span> - 3<span style="color: #00bfff;">)</span>;
<span style="color: #ffd700;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8fd2a0a" class="outline-3">
<h3 id="org8fd2a0a"><span class="section-number-3">2.5</span> <span class="done DONE">DONE</span> Counting Change Combinations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MEDI">MEDI</span></span></h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org00ff4ad" class="outline-4">
<h4 id="org00ff4ad"><span class="section-number-4">2.5.1</span> Description</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Write a function that counts how many different ways you can make change for an amount of money, 
given an array of coin denominations. 
For example, there are 3 ways to give change for 4 if you have coins with denomination 1 and 2:
<code>1+1+1+1, 1+1+2, 2+2.</code>
</p>

<p>
The order of coins does not matter:
<code>1+1+2 =</code> 2+1+1=
</p>

<p>
Also, assume that you have an infinite amount of coins.
</p>

<p>
Your function should take an amount to change and an array of unique denominations for the coins:
</p>

<div class="org-src-container">
<pre class="src src-c++">count_change<span style="color: #ffd700;">(</span>4,  <span style="color: #00bfff;">{</span>1,2<span style="color: #00bfff;">}</span><span style="color: #ffd700;">)</span>   <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">=&gt; 3</span>
count_change<span style="color: #ffd700;">(</span>10, <span style="color: #00bfff;">{</span>5,2,3<span style="color: #00bfff;">}</span><span style="color: #ffd700;">)</span> <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">=&gt; 4</span>
count_change<span style="color: #ffd700;">(</span>11, <span style="color: #00bfff;">{</span>5,7<span style="color: #00bfff;">}</span><span style="color: #ffd700;">)</span>   <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">=&gt; 0</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bf56a0" class="outline-4">
<h4 id="org0bf56a0"><span class="section-number-4">2.5.2</span> Analysis</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #888a85; font-style: italic;">-- </span><span style="color: #888a85; font-style: italic;">m := money</span>
<span style="color: #888a85; font-style: italic;">-- </span><span style="color: #888a85; font-style: italic;">i := index of coins</span>
<span style="color: #edd400; font-weight: bold;">count</span> m i <span style="color: #ff6347; font-weight: bold;">=</span> count <span style="color: #ffd700;">(</span>m <span style="color: #ff6347; font-weight: bold;">-</span> <span style="color: #00bfff;">(</span>coins i<span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span> i <span style="color: #ff6347; font-weight: bold;">+</span> count m <span style="color: #ffd700;">(</span>i <span style="color: #ff6347; font-weight: bold;">+</span> 1<span style="color: #ffd700;">)</span>
<span style="color: #edd400; font-weight: bold;">count</span> 0 <span style="color: #729fcf; font-weight: bold;">_</span> <span style="color: #ff6347; font-weight: bold;">=</span> 1
</pre>
</div>
<p>
found a bug here, you can't export to html if u have codes on the 1st line of haskell code block
</p>
</div>
<ol class="org-ol">
