DragonScript.org
*** Solution

#+BEGIN_SRC c++

#include <vector>
#include <algorithm>

using std::vector;
using large = unsigned long long;
large
dp(unsigned money, const vector<unsigned int>& coins) {

  large ans(0);
  large **rc = new large*[money + 1];
  for (int i = 0; i < money+1; ++i) rc[i] = new large[coins.size()];
  
  for(int i(0); i <= money; ++i)
    rc[i][coins.size()-1] = i % coins[coins.size()-1] == 0 ? 1 : 0;
  for(int j(0); j < coins.size(); ++j)
    rc[0][j] = 1;
  
  for(int i(1); i <= money; ++i)
    for(int j(coins.size()-2); j >= 0; --j) {
      
      if(i >= coins[j]) {
        rc[i][j] = rc[i - coins[j]][j]
                 + rc[i][j + 1];
      }
      else rc[i][j] = 0;
    }
  
  return rc[money][0];
}
//count m i = count (m-coins[i]) i + count m (i+1)
//count 0 _ = 1

large 
countChange(const unsigned int money, const vector<unsigned int>& coins) {

  large ans(0);
  
  vector<unsigned int> pac(coins);
  std::sort(pac.begin(), pac.end());

  ans = dp(money, pac);
  
  return ans;
}

#+END_SRC

#+BEGIN_SRC c++
using large = unsigned long long;
large 
countChange(unsigned money, const std::vector<unsigned>& coins) {
  std::vector<large> ks(money + 1);
  ks[0] = 1;
  for (unsigned i : coins)
    for (unsigned j = i; j <= money; j++)
      ks[j] += ks[j - i];
  return ks[money];
}
#+END_SRC
Somehow a little confused with this solution)

