DragonScript.html
<li><a id="orgb0654ab"></a>Complexity<br />
<div class="outline-text-5" id="text-2-5-2-1">
<p>
underwork
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org48ca3fe" class="outline-4">
<h4 id="org48ca3fe"><span class="section-number-4">2.5.3</span> Solution</h4>
<div class="outline-text-4" id="text-2-5-3">
<div class="org-src-container">
<pre class="src src-c++">
<span style="color: #729fcf;">#include</span> <span style="color: #ffd700; font-style: italic;">&lt;</span><span style="color: #ad7fa8; font-style: italic;">vector</span><span style="color: #ffd700; font-style: italic;">&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ffd700; font-style: italic;">&lt;</span><span style="color: #ad7fa8; font-style: italic;">algorithm</span><span style="color: #ffd700; font-style: italic;">&gt;</span>

<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #8ae234; font-weight: bold;">std</span>::<span style="color: #8ae234; font-weight: bold;">vector</span>;
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #8ae234; font-weight: bold;">large</span> = <span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span>;
<span style="color: #8ae234; font-weight: bold;">large</span>
<span style="color: #edd400; font-weight: bold;">dp</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #ff6347; font-weight: bold;">money</span>, <span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">vector</span><span style="color: #00bfff;">&lt;</span><span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #8ae234; font-weight: bold;">int</span><span style="color: #00bfff;">&gt;</span>&amp; <span style="color: #ff6347; font-weight: bold;">coins</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>

  <span style="color: #8ae234; font-weight: bold;">large</span> <span style="color: #ff6347; font-weight: bold;">ans</span><span style="color: #00bfff;">(</span>0<span style="color: #00bfff;">)</span>;
  <span style="color: #8ae234; font-weight: bold;">large</span> **<span style="color: #ff6347; font-weight: bold;">rc</span> = <span style="color: #729fcf; font-weight: bold;">new</span> <span style="color: #8ae234; font-weight: bold;">large</span>*<span style="color: #00bfff;">[</span><span style="color: #8ae234; font-weight: bold;">money</span> + 1<span style="color: #00bfff;">]</span>;
  <span style="color: #729fcf; font-weight: bold;">for</span> <span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">i</span> = 0; i &lt; money+1; ++i<span style="color: #00bfff;">)</span> rc<span style="color: #00bfff;">[</span>i<span style="color: #00bfff;">]</span> = <span style="color: #729fcf; font-weight: bold;">new</span> <span style="color: #8ae234; font-weight: bold;">large</span><span style="color: #00bfff;">[</span>coins.size<span style="color: #ffa500;">()</span><span style="color: #00bfff;">]</span>;
  
  <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">i</span><span style="color: #ffa500;">(</span>0<span style="color: #ffa500;">)</span>; i &lt;= money; ++i<span style="color: #00bfff;">)</span>
    rc<span style="color: #00bfff;">[</span>i<span style="color: #00bfff;">][</span>coins.size<span style="color: #ffa500;">()</span>-1<span style="color: #00bfff;">]</span> = i % coins<span style="color: #00bfff;">[</span>coins.size<span style="color: #ffa500;">()</span>-1<span style="color: #00bfff;">]</span> == 0 ? 1 : 0;
  <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">j</span><span style="color: #ffa500;">(</span>0<span style="color: #ffa500;">)</span>; j &lt; coins.size<span style="color: #ffa500;">()</span>; ++j<span style="color: #00bfff;">)</span>
    rc<span style="color: #00bfff;">[</span>0<span style="color: #00bfff;">][</span>j<span style="color: #00bfff;">]</span> = 1;
  
  <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">i</span><span style="color: #ffa500;">(</span>1<span style="color: #ffa500;">)</span>; i &lt;= money; ++i<span style="color: #00bfff;">)</span>
    <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">j</span><span style="color: #ffa500;">(</span>coins.size<span style="color: #ff7f50;">()</span>-2<span style="color: #ffa500;">)</span>; j &gt;= 0; --j<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
      
      <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ffa500;">(</span>i &gt;= coins<span style="color: #ff7f50;">[</span>j<span style="color: #ff7f50;">]</span><span style="color: #ffa500;">)</span> <span style="color: #ffa500;">{</span>
        rc<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">][</span>j<span style="color: #ff7f50;">]</span> = rc<span style="color: #ff7f50;">[</span>i - coins<span style="color: #00ff00;">[</span>j<span style="color: #00ff00;">]</span><span style="color: #ff7f50;">][</span>j<span style="color: #ff7f50;">]</span>
                 + rc<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">][</span>j + 1<span style="color: #ff7f50;">]</span>;
      <span style="color: #ffa500;">}</span>
      <span style="color: #729fcf; font-weight: bold;">else</span> rc<span style="color: #ffa500;">[</span>i<span style="color: #ffa500;">][</span>j<span style="color: #ffa500;">]</span> = 0;
    <span style="color: #00bfff;">}</span>
  
  <span style="color: #729fcf; font-weight: bold;">return</span> rc<span style="color: #00bfff;">[</span>money<span style="color: #00bfff;">][</span>0<span style="color: #00bfff;">]</span>;
<span style="color: #ffd700;">}</span>
<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">count m i = count (m-coins[i]) i + count m (i+1)</span>
<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">count 0 _ = 1</span>

<span style="color: #8ae234; font-weight: bold;">large</span> 
<span style="color: #edd400; font-weight: bold;">countChange</span><span style="color: #ffd700;">(</span><span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">money</span>, <span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">vector</span><span style="color: #00bfff;">&lt;</span><span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #8ae234; font-weight: bold;">int</span><span style="color: #00bfff;">&gt;</span>&amp; <span style="color: #ff6347; font-weight: bold;">coins</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>

  <span style="color: #8ae234; font-weight: bold;">large</span> <span style="color: #ff6347; font-weight: bold;">ans</span><span style="color: #00bfff;">(</span>0<span style="color: #00bfff;">)</span>;
  
  <span style="color: #8ae234; font-weight: bold;">vector</span><span style="color: #00bfff;">&lt;</span><span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #8ae234; font-weight: bold;">int</span><span style="color: #00bfff;">&gt;</span> <span style="color: #ff6347; font-weight: bold;">pac</span><span style="color: #00bfff;">(</span>coins<span style="color: #00bfff;">)</span>;
  <span style="color: #8ae234; font-weight: bold;">std</span>::sort<span style="color: #00bfff;">(</span>pac.begin<span style="color: #ffa500;">()</span>, pac.end<span style="color: #ffa500;">()</span><span style="color: #00bfff;">)</span>;

  ans = dp<span style="color: #00bfff;">(</span>money, pac<span style="color: #00bfff;">)</span>;
  
  <span style="color: #729fcf; font-weight: bold;">return</span> ans;
<span style="color: #ffd700;">}</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #8ae234; font-weight: bold;">large</span> = <span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span>;
<span style="color: #8ae234; font-weight: bold;">large</span> 
<span style="color: #edd400; font-weight: bold;">countChange</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #ff6347; font-weight: bold;">money</span>, <span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #8ae234; font-weight: bold;">std</span>::<span style="color: #8ae234; font-weight: bold;">vector</span><span style="color: #00bfff;">&lt;</span><span style="color: #8ae234; font-weight: bold;">unsigned</span><span style="color: #00bfff;">&gt;</span>&amp; <span style="color: #ff6347; font-weight: bold;">coins</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>
  <span style="color: #8ae234; font-weight: bold;">std</span>::<span style="color: #8ae234; font-weight: bold;">vector</span><span style="color: #00bfff;">&lt;</span><span style="color: #8ae234; font-weight: bold;">large</span><span style="color: #00bfff;">&gt;</span> <span style="color: #ff6347; font-weight: bold;">ks</span><span style="color: #00bfff;">(</span>money + 1<span style="color: #00bfff;">)</span>;
  ks<span style="color: #00bfff;">[</span>0<span style="color: #00bfff;">]</span> = 1;
  <span style="color: #729fcf; font-weight: bold;">for</span> <span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #ff6347; font-weight: bold;">i</span> : coins<span style="color: #00bfff;">)</span>
    <span style="color: #729fcf; font-weight: bold;">for</span> <span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #ff6347; font-weight: bold;">j</span> = i; j &lt;= money; j++<span style="color: #00bfff;">)</span>
      ks<span style="color: #00bfff;">[</span>j<span style="color: #00bfff;">]</span> += ks<span style="color: #00bfff;">[</span>j - i<span style="color: #00bfff;">]</span>;
  <span style="color: #729fcf; font-weight: bold;">return</span> ks<span style="color: #00bfff;">[</span>money<span style="color: #00bfff;">]</span>;
<span style="color: #ffd700;">}</span>
</pre>
</div>
<p>
Somehow a little confused with this solution)
</p>
</div>
</div>
</div>
