DragonScript.org
** DONE ZigZag Conversion                                              :MEDI:

*** Description
The string "PAYPALISHIRING" is written in a zigzag pattern on a given number of rows like this: (you may want to display this pattern in a fixed font for better legibility)
#+BEGIN_SRC
P   A   H   N
A P L S I I G
Y   I   R
#+END_SRC
And then read line by line: "PAHNAPLSIIGYIR"

Write the code that will take a string and make this conversion given a number of rows:

string convert(string s, int numRows);

Example 1:
#+BEGIN_SRC
Input: s = "PAYPALISHIRING", numRows = 3
Output: "PAHNAPLSIIGYIR"
#+END_SRC

Example 2:
#+BEGIN_SRC
Input: s = "PAYPALISHIRING", numRows = 4
Output: "PINALSIGYAHRPI"

Explanation:

P     I    N
A   L S  I G
Y A   H R
P     I
#+END_SRC

*** Solution

#+BEGIN_SRC c++

string Solution::convert(string s, int numRows) {
  
  string ans("");
  int cur(0);
  if(numRows == 1) return s;
  for(int i(1); i <= numRows; ++i) {
    
    int j(cur), invert(numRows - i);
    ans += string(1, s[cur]);
    while((cur = cur + invert * 2) < s.size()) {
      
      ans += invert ? string(1, s[cur]) : "";
      invert = (numRows - invert - 1);
      if(cur + invert * 2 < s.size()) {
        ans += invert ? 
          (cur += invert * 2, string(1, s[cur])) : "";
      } else break;
      invert = (numRows - invert - 1);
    }
    cur = i;
  }
  
  return ans;
}

#+END_SRC

** DONE Longest Palindromic Substring                             :HARD:BOND:

*** Description
Given a string s, find the longest palindromic substring in s. You may assume that the maximum length of s is 1000.

Example 1:
#+BEGIN_SRC
Input: "babad"
Output: "bab"
Note: "aba" is also a valid answer.
#+END_SRC

Example 2:
#+BEGIN_SRC
Input: "cbbd"
Output: "bb"
#+END_SRC

*** Analysis

Let's first find the way to get the longest length
#+BEGIN_SRC haskell

-- s := the string(data)
-- i := left index
-- j := right index
f i j | i == j     = 1
      | j - i == 2 = if s[i] == s[j] then 2 else 0
      | otherwise  = if s[i] == s[j] && inner then inner + 2 else 0
where inner = f (i + 1) (j - 1)
#+END_SRC

*** Solution

**** Dynamic Programming
#+BEGIN_SRC c++

//DP method
string longestPalindrome(string s) {
  
  int rc[1000][1000], start(0), end(0), cur(0);
  for(int i(s.size()-1); i >= 0; --i) {
    for(int j(i); j < s.size(); ++j) {
      
      if(i == j) rc[i][j] = 1;
      else if(j - i == 1) rc[i][j] = s[i] == s[j] ? 2 : 0;
      else rc[i][j] = 
        rc[i+1][j-1] && s[i] == s[j] ? rc[i+1][j-1] + 2 : 0;
      cur = rc[i][j] > cur ?
        start = i, end = j, rc[i][j] : cur;
    }
  }
  return s.substr(start, end-start+1);
}

#+END_SRC
- Summary
  Focus on how answer is constructed by answers.
  Unfortunately, still O(n^2)

**** Manacher's Algorithm
underwork

** DONE Maximum Subarray                                          :MEDI:BOND:

*** Description
Given an integer array nums, 
find the contiguous subarray (containing at least one number) 
which has the largest sum and return its sum.

Example:
#+BEGIN_SRC
Input: [-2,1,-3,4,-1,2,1,-5,4],
Output: 6
Explanation: [4,-1,2,1] has the largest sum = 6.
Follow up:
#+END_SRC
If you have figured out the O(n) solution, 
try coding another solution using the divide and conquer approach, 
which is more subtle.

