DragonScript.html

<div id="outline-container-org5113345" class="outline-3">
<h3 id="org5113345"><span class="section-number-3">2.6</span> <span class="done DONE">DONE</span> Longest Palindromic Substring</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-org43b6b52" class="outline-4">
<h4 id="org43b6b52"><span class="section-number-4">2.6.1</span> Description</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
Given a string s, find the longest palindromic substring in s. You may assume that the maximum length of s is 1000.
</p>

<p>
Example 1:
</p>
<pre class="example">
Input: "babad"
Output: "bab"
Note: "aba" is also a valid answer.
</pre>

<p>
Example 2:
</p>
<pre class="example">
Input: "cbbd"
Output: "bb"
</pre>
</div>
</div>

<div id="outline-container-org81c1f4f" class="outline-4">
<h4 id="org81c1f4f"><span class="section-number-4">2.6.2</span> Solution</h4>
<div class="outline-text-4" id="text-2-6-2">
<div class="org-src-container">
<pre class="src src-c++">
<span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">DP method</span>
<span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #edd400; font-weight: bold;">longestPalindrome</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347; font-weight: bold;">s</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>
  
  <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">rc</span><span style="color: #00bfff;">[</span>1000<span style="color: #00bfff;">][</span>1000<span style="color: #00bfff;">]</span>, <span style="color: #ff6347; font-weight: bold;">start</span><span style="color: #00bfff;">(</span>0<span style="color: #00bfff;">)</span>, <span style="color: #ff6347; font-weight: bold;">end</span><span style="color: #00bfff;">(</span>0<span style="color: #00bfff;">)</span>, <span style="color: #ff6347; font-weight: bold;">cur</span><span style="color: #00bfff;">(</span>0<span style="color: #00bfff;">)</span>;
  <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">i</span><span style="color: #ffa500;">(</span>s.size<span style="color: #ff7f50;">()</span>-1<span style="color: #ffa500;">)</span>; i &gt;= 0; --i<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
    <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">j</span><span style="color: #ff7f50;">(</span>i<span style="color: #ff7f50;">)</span>; j &lt; s.size<span style="color: #ff7f50;">()</span>; ++j<span style="color: #ffa500;">)</span> <span style="color: #ffa500;">{</span>
      
      <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ff7f50;">(</span>i == j<span style="color: #ff7f50;">)</span> rc<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">][</span>j<span style="color: #ff7f50;">]</span> = 1;
      <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ff7f50;">(</span>j - i == 1<span style="color: #ff7f50;">)</span> rc<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">][</span>j<span style="color: #ff7f50;">]</span> = s<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span> == s<span style="color: #ff7f50;">[</span>j<span style="color: #ff7f50;">]</span> ? 2 : 0;
      <span style="color: #729fcf; font-weight: bold;">else</span> rc<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">][</span>j<span style="color: #ff7f50;">]</span> = 
        rc<span style="color: #ff7f50;">[</span>i+1<span style="color: #ff7f50;">][</span>j-1<span style="color: #ff7f50;">]</span> &amp;&amp; s<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">]</span> == s<span style="color: #ff7f50;">[</span>j<span style="color: #ff7f50;">]</span> ? rc<span style="color: #ff7f50;">[</span>i+1<span style="color: #ff7f50;">][</span>j-1<span style="color: #ff7f50;">]</span> + 2 : 0;
      cur = rc<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">][</span>j<span style="color: #ff7f50;">]</span> &gt; cur ?
        start = i, end = j, rc<span style="color: #ff7f50;">[</span>i<span style="color: #ff7f50;">][</span>j<span style="color: #ff7f50;">]</span> : cur;
    <span style="color: #ffa500;">}</span>
  <span style="color: #00bfff;">}</span>
  <span style="color: #729fcf; font-weight: bold;">return</span> s.substr<span style="color: #00bfff;">(</span>start, end-start+1<span style="color: #00bfff;">)</span>;
<span style="color: #ffd700;">}</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd68245a" class="outline-3">
<h3 id="orgd68245a"><span class="section-number-3">2.7</span> <span class="done DONE">DONE</span> ZigZag Conversion</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-orgf911421" class="outline-4">
<h4 id="orgf911421"><span class="section-number-4">2.7.1</span> Description</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
The string "PAYPALISHIRING" is written in a zigzag pattern on a given number of rows like this: (you may want to display this pattern in a fixed font for better legibility)
</p>
<pre class="example">
P   A   H   N
A P L S I I G
Y   I   R
</pre>
<p>
And then read line by line: "PAHNAPLSIIGYIR"
</p>

<p>
Write the code that will take a string and make this conversion given a number of rows:
</p>

<p>
string convert(string s, int numRows);
</p>

<p>
Example 1:
</p>
<pre class="example">
Input: s = "PAYPALISHIRING", numRows = 3
Output: "PAHNAPLSIIGYIR"
</pre>

<p>
Example 2:
</p>
<pre class="example">
Input: s = "PAYPALISHIRING", numRows = 4
Output: "PINALSIGYAHRPI"

Explanation:

P     I    N
A   L S  I G
Y A   H R
P     I
</pre>
</div>
</div>

<div id="outline-container-org7d31aa3" class="outline-4">
<h4 id="org7d31aa3"><span class="section-number-4">2.7.2</span> Solution</h4>
<div class="outline-text-4" id="text-2-7-2">
<div class="org-src-container">
<pre class="src src-c++">
<span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #8ae234; font-weight: bold;">Solution</span>::<span style="color: #edd400; font-weight: bold;">convert</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347; font-weight: bold;">s</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">numRows</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>
  
  <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347; font-weight: bold;">ans</span><span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">""</span><span style="color: #00bfff;">)</span>;
  <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">cur</span><span style="color: #00bfff;">(</span>0<span style="color: #00bfff;">)</span>;
  <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #00bfff;">(</span>numRows == 1<span style="color: #00bfff;">)</span> <span style="color: #729fcf; font-weight: bold;">return</span> s;
  <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">i</span><span style="color: #ffa500;">(</span>1<span style="color: #ffa500;">)</span>; i &lt;= numRows; ++i<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
    
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">j</span><span style="color: #ffa500;">(</span>cur<span style="color: #ffa500;">)</span>, <span style="color: #ff6347; font-weight: bold;">invert</span><span style="color: #ffa500;">(</span>numRows - i<span style="color: #ffa500;">)</span>;
    ans += string<span style="color: #ffa500;">(</span>1, s<span style="color: #ff7f50;">[</span>cur<span style="color: #ff7f50;">]</span><span style="color: #ffa500;">)</span>;
    <span style="color: #729fcf; font-weight: bold;">while</span><span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span>cur = cur + invert * 2<span style="color: #ff7f50;">)</span> &lt; s.size<span style="color: #ff7f50;">()</span><span style="color: #ffa500;">)</span> <span style="color: #ffa500;">{</span>
      
      ans += invert ? string<span style="color: #ff7f50;">(</span>1, s<span style="color: #00ff00;">[</span>cur<span style="color: #00ff00;">]</span><span style="color: #ff7f50;">)</span> : <span style="color: #ad7fa8; font-style: italic;">""</span>;
      invert = <span style="color: #ff7f50;">(</span>numRows - invert - 1<span style="color: #ff7f50;">)</span>;
      <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ff7f50;">(</span>cur + invert * 2 &lt; s.size<span style="color: #00ff00;">()</span><span style="color: #ff7f50;">)</span> <span style="color: #ff7f50;">{</span>
        ans += invert ? 
          <span style="color: #00ff00;">(</span>cur += invert * 2, string<span style="color: #a020f0;">(</span>1, s<span style="color: #ffff00;">[</span>cur<span style="color: #ffff00;">]</span><span style="color: #a020f0;">)</span><span style="color: #00ff00;">)</span> : <span style="color: #ad7fa8; font-style: italic;">""</span>;
      <span style="color: #ff7f50;">}</span> <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">break</span>;
      invert = <span style="color: #ff7f50;">(</span>numRows - invert - 1<span style="color: #ff7f50;">)</span>;
    <span style="color: #ffa500;">}</span>
    cur = i;
  <span style="color: #00bfff;">}</span>
  
  <span style="color: #729fcf; font-weight: bold;">return</span> ans;
<span style="color: #ffd700;">}</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org089f41f" class="outline-3">
<h3 id="org089f41f"><span class="section-number-3">2.8</span> <span class="done DONE">DONE</span> Maximum Subarray</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-orgfef68f0" class="outline-4">
<h4 id="orgfef68f0"><span class="section-number-4">2.8.1</span> Description</h4>
<div class="outline-text-4" id="text-2-8-1">
<p>
Given an integer array nums, 
find the contiguous subarray (containing at least one number) 
which has the largest sum and return its sum.
</p>

<p>
Example:
</p>
<pre class="example">
Input: [-2,1,-3,4,-1,2,1,-5,4],
Output: 6
Explanation: [4,-1,2,1] has the largest sum = 6.
Follow up:
</pre>
<p>
If you have figured out the O(n) solution, 
try coding another solution using the divide and conquer approach, 
which is more subtle.
</p>
</div>
</div>
