DragonScript.org
*** Solution
#+BEGIN_SRC C++

int Solution::maxSubArray(vector<int>& nums) {
  
  int ans(INT_MIN), sum(0);
  for (int n : nums)
    sum = max(sum + n, n),
    ans = max(ans, sum);
  
  return ans;
}

#+END_SRC

** DONE Climbing Stairs                                                :EASY:

*** Description
You are climbing a stair case. It takes n steps to reach to the top.

Each time you can either climb 1 or 2 steps. In how many distinct ways can you climb to the top?

Note: Given n will be a positive integer.

Example 1:
#+BEGIN_SRC
Input: 2
Output: 2
Explanation: There are two ways to climb to the top.
1. 1 step + 1 step
2. 2 steps
#+END_SRC
Example 2:
#+BEGIN_SRC
Input: 3
Output: 3
Explanation: There are three ways to climb to the top.
1. 1 step + 1 step + 1 step
2. 1 step + 2 steps
3. 2 steps + 1 step
#+END_SRC

*** Analysis

#+BEGIN_SRC haskell

f 0 = 1
f n = if n < 0 then 0 else f (n-1) + f (n-2)
#+END_SRC
Obviously, it's a fibonacci seq!

*** Solution
#+BEGIN_SRC c++

int Solution::climbStairs(int n) {
  
  int a(0), b(1), x(0);
  for(int i(2); i <= n; ++i)
    x = a + b,
    a = b, b = x;
  
  return a + b;
}

#+END_SRC

** DONE Regular Expression Matching                                    :HARD:

*** Description
Given an input string (s) and a pattern (p), 
implement regular expression matching with support for '.' and '*'.

- '.' Matches any single character.
- '*' Matches zero or more of the preceding element.
The matching should cover the entire input string (not partial).

Note:

- s could be empty and contains only lowercase letters a-z.
- p could be empty and contains only lowercase letters a-z, and characters like . or *.
Example 1:
#+BEGIN_SRC
Input:
s = "aa"
p = "a"
Output: false
Explanation: "a" does not match the entire string "aa".
#+END_SRC
Example 2:
#+BEGIN_SRC
Input:
s = "aa"
p = "a*"
Output: true
Explanation: '*' means zero or more of the preceding element, 'a'. Therefore, by repeating 'a' once, it becomes "aa".
#+END_SRC
Example 3:
#+BEGIN_SRC
Input:
s = "ab"
p = ".*"
Output: true
Explanation: ".*" means "zero or more (*) of any character (.)".
#+END_SRC
Example 4:
#+BEGIN_SRC
Input:
s = "aab"
p = "c*a*b"
Output: true
Explanation: c can be repeated 0 times, a can be repeated 1 time. Therefore, it matches "aab".
#+END_SRC
Example 5:
#+BEGIN_SRC
Input:
s = "mississippi"
p = "mis*is*p*."
Output: false
#+END_SRC

*** Solution
#+BEGIN_SRC c++
bool Solution::isMatch(string s, string p) {
  
  return
    p == "" ? s == "" :
    p.size() > 1 && p[1] == '*' ?
      isMatch(s, p.substr(2)) || 
        (s != "" && (s[0] == p[0] || p[0] == '.') && isMatch(s.substr(1), p)) :
    s != "" && 
      (s[0] == p[0] || p[0] == '.') && isMatch(s.substr(1), p.substr(1));
}

#+END_SRC

** DONE Wildcard Matching                                              :MEDI:

*** Description
Given an input string (s) and a pattern (p), implement wildcard pattern matching with support for '?' and '*'.
#+BEGIN_SRC
'?' Matches any single character.
'*' Matches any sequence of characters (including the empty sequence).
The matching should cover the entire input string (not partial).

Note:

s could be empty and contains only lowercase letters a-z.
p could be empty and contains only lowercase letters a-z, and characters like ? or *.
Example 1:

Input:
s = "aa"
p = "a"
Output: false
Explanation: "a" does not match the entire string "aa".
Example 2:

Input:
s = "aa"
p = "*"
Output: true
Explanation: '*' matches any sequence.
Example 3:

Input:
s = "cb"
p = "?a"
Output: false
Explanation: '?' matches 'c', but the second letter is 'a', which does not match 'b'.
Example 4:

Input:
s = "adceb"
p = "*a*b"
Output: true
Explanation: The first '*' matches the empty sequence, while the second '*' matches the substring "dce".
Example 5:

Input:
s = "acdcb"
p = "a*c?b"
Output: false
#+END_SRC

