DragonScript.html

<div id="outline-container-orgd9dcebf" class="outline-4">
<h4 id="orgd9dcebf"><span class="section-number-4">2.8.2</span> Solution</h4>
<div class="outline-text-4" id="text-2-8-2">
<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #8ae234; font-weight: bold;">Solution</span>::<span style="color: #edd400; font-weight: bold;">maxSubArray</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">vector</span><span style="color: #00bfff;">&lt;</span><span style="color: #8ae234; font-weight: bold;">int</span><span style="color: #00bfff;">&gt;</span>&amp; <span style="color: #ff6347; font-weight: bold;">nums</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>
  
  <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">ans</span><span style="color: #00bfff;">(</span>INT_MIN<span style="color: #00bfff;">)</span>, <span style="color: #ff6347; font-weight: bold;">sum</span><span style="color: #00bfff;">(</span>0<span style="color: #00bfff;">)</span>;
  <span style="color: #729fcf; font-weight: bold;">for</span> <span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">n</span> : nums<span style="color: #00bfff;">)</span>
    sum = max<span style="color: #00bfff;">(</span>sum + n, n<span style="color: #00bfff;">)</span>,
    ans = max<span style="color: #00bfff;">(</span>ans, sum<span style="color: #00bfff;">)</span>;
  
  <span style="color: #729fcf; font-weight: bold;">return</span> ans;
<span style="color: #ffd700;">}</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org05f05dd" class="outline-3">
<h3 id="org05f05dd"><span class="section-number-3">2.9</span> <span class="done DONE">DONE</span> Climbing Stairs</h3>
<div class="outline-text-3" id="text-2-9">
</div>
<div id="outline-container-orgf1f45c5" class="outline-4">
<h4 id="orgf1f45c5"><span class="section-number-4">2.9.1</span> Description</h4>
<div class="outline-text-4" id="text-2-9-1">
<p>
You are climbing a stair case. It takes n steps to reach to the top.
</p>

<p>
Each time you can either climb 1 or 2 steps. In how many distinct ways can you climb to the top?
</p>

<p>
Note: Given n will be a positive integer.
</p>

<p>
Example 1:
</p>
<pre class="example">
Input: 2
Output: 2
Explanation: There are two ways to climb to the top.
1. 1 step + 1 step
2. 2 steps
</pre>
<p>
Example 2:
</p>
<pre class="example">
Input: 3
Output: 3
Explanation: There are three ways to climb to the top.
1. 1 step + 1 step + 1 step
2. 1 step + 2 steps
3. 2 steps + 1 step
</pre>
</div>
</div>

<div id="outline-container-org388e0fa" class="outline-4">
<h4 id="org388e0fa"><span class="section-number-4">2.9.2</span> Solution</h4>
<div class="outline-text-4" id="text-2-9-2">
<div class="org-src-container">
<pre class="src src-c++">
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #8ae234; font-weight: bold;">Solution</span>::<span style="color: #edd400; font-weight: bold;">climbStairs</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">n</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>
  
  <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">a</span><span style="color: #00bfff;">(</span>0<span style="color: #00bfff;">)</span>, <span style="color: #ff6347; font-weight: bold;">b</span><span style="color: #00bfff;">(</span>1<span style="color: #00bfff;">)</span>, <span style="color: #ff6347; font-weight: bold;">x</span><span style="color: #00bfff;">(</span>0<span style="color: #00bfff;">)</span>;
  <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">i</span><span style="color: #ffa500;">(</span>2<span style="color: #ffa500;">)</span>; i &lt;= n; ++i<span style="color: #00bfff;">)</span>
    x = a + b,
    a = b, b = x;
  
  <span style="color: #729fcf; font-weight: bold;">return</span> a + b;
<span style="color: #ffd700;">}</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd80335d" class="outline-3">
<h3 id="orgd80335d"><span class="section-number-3">2.10</span> <span class="done DONE">DONE</span> Regular Expression Matching</h3>
<div class="outline-text-3" id="text-2-10">
</div>
<div id="outline-container-org2ef7313" class="outline-4">
<h4 id="org2ef7313"><span class="section-number-4">2.10.1</span> Description</h4>
<div class="outline-text-4" id="text-2-10-1">
<p>
Given an input string (s) and a pattern (p), 
implement regular expression matching with support for '.' and '*'.
</p>

<ul class="org-ul">
<li>'.' Matches any single character.</li>
<li>'*' Matches zero or more of the preceding element.</li>
</ul>
<p>
The matching should cover the entire input string (not partial).
</p>

<p>
Note:
</p>

<ul class="org-ul">
<li>s could be empty and contains only lowercase letters a-z.</li>
<li>p could be empty and contains only lowercase letters a-z, and characters like . or *.</li>
</ul>
<p>
Example 1:
</p>
<pre class="example">
Input:
s = "aa"
p = "a"
Output: false
Explanation: "a" does not match the entire string "aa".
</pre>
<p>
Example 2:
</p>
<pre class="example">
Input:
s = "aa"
p = "a*"
Output: true
Explanation: '*' means zero or more of the preceding element, 'a'. Therefore, by repeating 'a' once, it becomes "aa".
</pre>
<p>
Example 3:
</p>
<pre class="example">
Input:
s = "ab"
p = ".*"
Output: true
Explanation: ".*" means "zero or more (*) of any character (.)".
</pre>
<p>
Example 4:
</p>
<pre class="example">
Input:
s = "aab"
p = "c*a*b"
Output: true
Explanation: c can be repeated 0 times, a can be repeated 1 time. Therefore, it matches "aab".
</pre>
<p>
Example 5:
</p>
<pre class="example">
Input:
s = "mississippi"
p = "mis*is*p*."
Output: false
</pre>
</div>
</div>

<div id="outline-container-org31118c0" class="outline-4">
<h4 id="org31118c0"><span class="section-number-4">2.10.2</span> Solution</h4>
<div class="outline-text-4" id="text-2-10-2">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #8ae234; font-weight: bold;">Solution</span>::<span style="color: #edd400; font-weight: bold;">isMatch</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347; font-weight: bold;">s</span>, <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347; font-weight: bold;">p</span><span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>
  
  <span style="color: #729fcf; font-weight: bold;">return</span>
    p == <span style="color: #ad7fa8; font-style: italic;">""</span> ? s == <span style="color: #ad7fa8; font-style: italic;">""</span> :
    p.size<span style="color: #00bfff;">()</span> &gt; 1 &amp;&amp; p<span style="color: #00bfff;">[</span>1<span style="color: #00bfff;">]</span> == <span style="color: #ad7fa8; font-style: italic;">'*'</span> ?
      isMatch<span style="color: #00bfff;">(</span>s, p.substr<span style="color: #ffa500;">(</span>2<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span> || 
        <span style="color: #00bfff;">(</span>s != <span style="color: #ad7fa8; font-style: italic;">""</span> &amp;&amp; <span style="color: #ffa500;">(</span>s<span style="color: #ff7f50;">[</span>0<span style="color: #ff7f50;">]</span> == p<span style="color: #ff7f50;">[</span>0<span style="color: #ff7f50;">]</span> || p<span style="color: #ff7f50;">[</span>0<span style="color: #ff7f50;">]</span> == <span style="color: #ad7fa8; font-style: italic;">'.'</span><span style="color: #ffa500;">)</span> &amp;&amp; isMatch<span style="color: #ffa500;">(</span>s.substr<span style="color: #ff7f50;">(</span>1<span style="color: #ff7f50;">)</span>, p<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span> :
    s != <span style="color: #ad7fa8; font-style: italic;">""</span> &amp;&amp; 
      <span style="color: #00bfff;">(</span>s<span style="color: #ffa500;">[</span>0<span style="color: #ffa500;">]</span> == p<span style="color: #ffa500;">[</span>0<span style="color: #ffa500;">]</span> || p<span style="color: #ffa500;">[</span>0<span style="color: #ffa500;">]</span> == <span style="color: #ad7fa8; font-style: italic;">'.'</span><span style="color: #00bfff;">)</span> &amp;&amp; isMatch<span style="color: #00bfff;">(</span>s.substr<span style="color: #ffa500;">(</span>1<span style="color: #ffa500;">)</span>, p.substr<span style="color: #ffa500;">(</span>1<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span>;
<span style="color: #ffd700;">}</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org29a3de3" class="outline-3">
<h3 id="org29a3de3"><span class="section-number-3">2.11</span> <span class="done DONE">DONE</span> Wildcard Matching</h3>
<div class="outline-text-3" id="text-2-11">
</div>
<div id="outline-container-orgbf09da7" class="outline-4">
<h4 id="orgbf09da7"><span class="section-number-4">2.11.1</span> Description</h4>
<div class="outline-text-4" id="text-2-11-1">
<p>
Given an input string (s) and a pattern (p), implement wildcard pattern matching with support for '?' and '*'.
</p>
<pre class="example">
'?' Matches any single character.
'*' Matches any sequence of characters (including the empty sequence).
The matching should cover the entire input string (not partial).

Note:

s could be empty and contains only lowercase letters a-z.
p could be empty and contains only lowercase letters a-z, and characters like ? or *.
Example 1:

Input:
s = "aa"
p = "a"
Output: false
Explanation: "a" does not match the entire string "aa".
Example 2:

Input:
s = "aa"
p = "*"
Output: true
Explanation: '*' matches any sequence.
Example 3:

Input:
s = "cb"
p = "?a"
Output: false
Explanation: '?' matches 'c', but the second letter is 'a', which does not match 'b'.
Example 4:

Input:
s = "adceb"
p = "*a*b"
Output: true
Explanation: The first '*' matches the empty sequence, while the second '*' matches the substring "dce".
Example 5:

Input:
s = "acdcb"
p = "a*c?b"
Output: false
</pre>
</div>
</div>
